In [1]:
%matplotlib inline
import pandas as pd

In [2]:
from IPython.core.display import HTML
#css = open('style-table.css').read() + open('style-notebook.css').read()
#HTML('<style>{}</style>'.format(css))

In [3]:
titles = pd.read_csv('dataset/titles.csv')
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

In [4]:

titles.tail()

                                      title  year
244909  Black Butterfly in a Colorful World  2018
244910        Hua fei hua wu chun man cheng  1980
244911                 Nippon dabi katsukyu  1970
244912        Under Siege 2: Dark Territory  1995
244913            She Must Be Seeing Things  1987

### How many movies are listed in the titles dataframe?

In [5]:
titles.isna().sum()

title    0
year     0
dtype: int64

In [6]:
print('Number of movies listed',titles.title.count())

Number of movies listed 244914

### What are the earliest two films listed in the titles dataframe?

In [7]:
titles.sort_values(by='year').head(2)
#print(titles.year.sort_values())

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [8]:
cnt = titles[titles.title == 'Hamlet'].title.shape[0]
print('Number of Hamlet movies', cnt)

Number of Hamlet movies 20

### How many movies are titled "North by Northwest"?

In [9]:
cnt_nwst = titles[titles.title=='North by Northwest'].title.shape[0]
print(cnt_nwst)

1

### When was the first movie titled "Hamlet" made?

In [10]:
hmlt_movies = titles[titles.title == 'Hamlet']
first_hmlt_mve = hmlt_movies.sort_values(by='year').head(1)
first_hmlt_mve['year']

52521    1910
Name: year, dtype: int64

### List all of the "Treasure Island" movies from earliest to most recent.

In [11]:
thrs_island= titles[titles.title=='Treasure Island'].sort_values('year')
print(thrs_island)

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

### How many movies were made in the year 1950?

In [18]:
movies_1950 = titles[titles.year == 1950].year.value_counts()
#print(movies_1950)
print('number of movies made in year 1950',titles[titles.year == 1950].shape[0])

number of movies made in year 1950 1113

### How many movies were made in the year 1960?

In [21]:
movies_1960 = titles[titles.year == 1960].shape[0]
print('no. of movies made in year 1960: ',movies_1960)

no. of movies made in year 1960:  1549

### How many movies were made from 1950 through 1959?

In [23]:
mvs_1950_1959 = titles[(titles.year >= 1950) &(titles.year <=1959)]
print('no.of movies made between 1950 and 1950',mvs_1950_1959.shape[0])

no.of movies made between 1950 and 1950 12934

### In what years has a movie titled "Batman" been released?

In [24]:
btmn_mvs = titles[titles['title']=='Batman']
list(btmn_mvs.year)
#print(type(btmn_mvs))

[1943, 1989]

### How many roles were there in the movie "Inception"?

In [25]:
import pandas as pd
roles = pd.read_csv("dataset/cast.csv")
roles.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [26]:
roles[roles.title == 'Inception'].name.isna().sum()
#print(roles[roles.title == 'Inception'].name.unique())
print('Roles in inception movie are',roles[roles.title == 'Inception'].type.unique())

Roles in inception movie are ['actor' 'actress']

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [27]:
roles_ranks = roles[roles.title == 'Inception'].n.isna().sum()
print('No.of roles who are not ranked',roles_ranks)
inception_movies =  roles[roles.title == 'Inception']
#print(inception_movies)
filter_movies = inception_movies[['type', 'n']]
print('\n inception movies list with columns type and rank n \n ')
print(filter_movies)
print('distinct roles who are not having ranked by n in list form',filter_movies[filter_movies.n.isna()].type.unique().tolist())
print('No. of roles who are not ranked, ',filter_movies[filter_movies.n.isna()].shape[0])

No.of roles who are not ranked 27

 inception movies list with columns type and rank n

            type     n
98153      actor   NaN
149008     actor  44.0
183937     actor   8.0
197877     actor   NaN
260128     actor  29.0
...          ...   ...
3387147  actress   3.0
3444628  actress  43.0
3473041  actress  48.0
3480170  actress  25.0
3731263  actress  51.0

[78 rows x 2 columns]
distinct roles who are not having ranked by n in list form ['actor', 'actress']
No. of roles who are not ranked,  27

### But how many roles in the movie "Inception" did receive an "n" value?

In [28]:
#print('\n inception movie\n', inception_movies)

print('number of roles in the inception movie who receive n value', inception_movies[~inception_movies.n.isna()].type.shape[0])
print('\n Inception movies list which are having n values\n', inception_movies[~inception_movies.n.isna()][['type', 'n']])

inception_movies[~inception_movies.n.isna()].type.shape[0]

#inception_movies[~inception_movies.n.isna()][['type', 'n']]

number of roles in the inception movie who receive n value 51

 Inception movies list which are having n values
             type     n
149008     actor  44.0
183937     actor   8.0
260128     actor  29.0
326745     actor  11.0
333415     actor  20.0
433867     actor  26.0
444385     actor  34.0
517227     actor  30.0
590576     actor   1.0
709436     actor  23.0
737322     actor  32.0
807795     actor  45.0
812135     actor  17.0
832083     actor  40.0
833376     actor  50.0
859993     actor   2.0
910757     actor  12.0
940923     actor   4.0
967176     actor  21.0
1170785    actor  24.0
1309851    actor  13.0
1455534    actor  18.0
1615709    actor   7.0
1618527    actor  35.0
1668790    actor  15.0
1701902    actor  19.0
1812091    actor  47.0
1826027    actor  10.0
1861317    actor  39.0
1876301    actor   6.0
2049179    actor  46.0
2250605    actor  49.0
2267383    actor  36.0
2406531    actor   5.0
2614557  actress  38.0
2765969  actress   9.0
2776554  actress  31.0
2807441  actress  27.0
2932657  actress  14.0
2932664  actress  16.0
3151982  actress  28.0
3158892  actress  33.0
3203564  actress  42.0
3225843  actress  41.0
3343512  actress  37.0
3359825  actress  22.0
3387147  actress   3.0
3444628  actress  43.0
3473041  actress  48.0
3480170  actress  25.0
3731263  actress  51.0

51

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [29]:
nrth_by_nrthwest_cast = roles[roles.title == 'North by Northwest']
print(nrth_by_nrthwest_cast[~nrth_by_nrthwest_cast.n.isna()].shape)
nrth_by_nrthwest_cast[~nrth_by_nrthwest_cast.n.isna()].sort_values(by='n')['name']

(16, 6)

871426               Cary Grant
3518333         Eva Marie Saint
1457165             James Mason
3157232     Jessie Royce Landis
356707           Leo G. Carroll
3048272    Josephine Hutchinson
1695173             Philip Ober
1275337           Martin Landau
2447081           Adam Williams
1811387            Edward Platt
665768        Robert Ellenstein
2295714            Les Tremayne
464736          Philip Coolidge
1508344           Patrick McVey
206471             Edward Binns
1384780               Ken Lynch
Name: name, dtype: object

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [30]:
#sleuth_movie = roles[roles.title == 'Sleuth']
#slt_movie_cast = sleuth_movie[['title','name','type','n']]
#slt_movie_cast.sort_values(by='n', na_position='last')


sleuth_movies = roles[roles.title == 'Sleuth'].sort_values(by='n', na_position='last')

sleuth_movies[sleuth_movies.year == 1972]

,title,year,name,type,character,n
1705394,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
326773,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
373876,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1465483,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2724553,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1448690,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [31]:
sleath_movies_2007 = sleuth_movies[sleuth_movies.year == 2007]
sleath_movies_2007

          title  year                 name     type          character    n
326774   Sleuth  2007        Michael Caine    actor             Andrew  1.0
1293634  Sleuth  2007             Jude Law    actor               Milo  2.0
1805907  Sleuth  2007        Harold Pinter    actor        Man on T.V.  3.0
260242   Sleuth  2007      Kenneth Branagh    actor  Other Man on T.V.  NaN
373877   Sleuth  2007  Alec (II) Cawthorne    actor  Inspector Doppler  NaN
2724552  Sleuth  2007    Eve (II) Channing  actress    Marguerite Wyke  NaN
3370424  Sleuth  2007    Carmel O'Sullivan  actress             Maggie  NaN

### How many roles were credited in the silent 1921 version of Hamlet?

In [32]:
silent_movies_1921= roles[roles.title == 'Hamlet'][roles.year == 1921]
#silent_movies.type.isna().sum()

print('Number of roles credited during 1921 version of hamlet are of ',silent_movies_1921.type.shape[0])

silent_movies_1921

Number of roles credited during 1921 version of hamlet are of  9

c:\users\pkkota\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

          title  year                    name     type         character    n
7789     Hamlet  1921        Fritz Achterberg    actor       Fortinbras,  9.0
458904   Hamlet  1921            Paul Conradi    actor      K?nig Hamlet  2.0
555034   Hamlet  1921        Anton De Verdier    actor           Laertes  7.0
1135279  Hamlet  1921         Hans Junkermann    actor          Polonius  6.0
2185558  Hamlet  1921            Heinz Stieda    actor           Horatio  5.0
2375993  Hamlet  1921  Eduard von Winterstein    actor          Claudius  4.0
2664423  Hamlet  1921         Mathilde Brandt  actress  K?nigin Gertrude  3.0
3062023  Hamlet  1921          Lilly Jacobson  actress           Ophelia  8.0
3355176  Hamlet  1921            Asta Nielsen  actress            Hamlet  1.0

### How many roles were credited in Branaghâ€™s 1996 Hamlet?

In [33]:
silent_movies_1996 = roles[roles.title == 'Hamlet'][roles.year == 1996]
silent_movies_1996.type.shape[0]

#roles[roles.title == 'Hamlet'].groupby(by='year').nunique()

c:\users\pkkota\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

54

### How many "Hamlet" roles have been listed in all film credits through history?

In [34]:
hamlet_movies = roles[roles.title == 'Hamlet']
hamlet_movies.type.isna().sum()
print('number of ham roles listed in all films',hamlet_movies.type.shape[0])

number of ham roles listed in all films 342

### How many people have played an "Ophelia"?

In [35]:
char_ophelia = roles[roles.character == 'Ophelia']
char_ophelia.character.shape[0]

117

### How many people have played a role called "The Dude"?

In [36]:
char_dude =roles[roles.character == 'The Dude']
char_dude.character.shape[0]

19

### How many people have played a role called "The Stranger"?

In [37]:
char_stranger = roles[roles.character=='The Stranger']

print(char_stranger.shape[0])

212

### How many roles has Sidney Poitier played throughout his career?

In [38]:
sidney_poiter = roles[roles.name == 'Sidney Poitier']

sidney_poiter.name.shape[0]

43

### How many roles has Judi Dench played?

In [39]:
judi = roles[roles.name == 'Judi Dench']
print('Number of roles judi dench played',judi.type.count())

Number of roles judi dench played 55

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [40]:


cary_suport = roles[roles.name == 'Cary Grant'][roles.year == 1940][roles.n==2]
print('Supporting role played by Cray grant is ',cary_suport.character)

Supporting role played by Cray grant is  871423    Nick Arden
Name: character, dtype: object

c:\users\pkkota\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [41]:
cary_lead = roles[roles.name == 'Cary Grant'][roles.year == 1940]
cary_lead.sort_values(by= 'n')

c:\users\pkkota\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

,title,year,name,type,character,n
871407,His Girl Friday,1940,Cary Grant,actor,Walter Burns,1.0
871448,The Howards of Virginia,1940,Cary Grant,actor,Matt Howard,1.0
871450,The Philadelphia Story,1940,Cary Grant,actor,C. K. Dexter Haven,1.0
871423,My Favorite Wife,1940,Cary Grant,actor,Nick Arden,2.0

### How many roles were available for actors in the 1950s?

In [42]:
actor_roles_1950 = roles[roles.year == 1950][roles.type == 'actor']
print('Number of roles availble in 1950\'s',actor_roles_1950.shape[0])

Number of roles availble in 1950's 16760

c:\users\pkkota\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

### How many roles were available for actresses in the 1950s?

In [43]:
actress_roles_1950 = roles[roles.year == 1950][roles.type == 'actress']
print('Number of roles availble in 1950\'s',actress_roles_1950.shape[0])

Number of roles availble in 1950's 5637

c:\users\pkkota\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [44]:
lead_roles_1980 = roles[roles.year == 1980][roles.n == 1]
print('no. of lead roles availbe from the beginging ',lead_roles_1980.shape[0])

no. of lead roles availbe from the beginging  1183

c:\users\pkkota\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

### How many non-leading roles were available through from the beginning of film history through 1980?

In [45]:
non_lead_roles_1980 = roles[roles.year == 1980][roles.n == 2]
print('no. of non lead roles availbe from the beginging ',non_lead_roles_1980.shape[0])

no. of non lead roles availbe from the beginging  1088

c:\users\pkkota\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [46]:
roles_1980 = roles[roles.year == 1980]
print('no.of roles that didnt not warrant a numeric rank',roles_1980.rank().isna().sum().n)

no.of roles that didnt not warrant a numeric rank 4466